of40/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    elecNorth
    {
	type            fixedValue;
	value           uniform (0 0 0);    
    }
   
    elecSouth
    {
	type            fixedValue;
	value           uniform (0 0 0);     
    }
    
    cylinder
    {
	type            fixedValue;
	value           uniform (0 0 0);
    }

    "wall.*"
    {
	type            fixedValue;
	value           uniform (0 0 0);     
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
