of40/tutorials/rheoEFoam/ICEO/PoissonBoltzmann/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|phiE|psi|U)"
    {
        solver          GAMG;
        tolerance       1e-8;
        relTol          0.;
        smoother        DIC;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        
    }
}

electricControls
{
  phiEEqn
   {
      residuals 1e-7;
      maxIter      1;
   }

  psiEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
   
   ciEqn
   {
      residuals 1e-7;
      maxIter      1;
   }
}

SIMPLE
{
    solveFluid      true;
     
    nInIter         1;
    nNonOrthogonalCorrectors 2;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
       
    }
}

relaxationFactors
{
    fields
     {        
	p 	1;
     }

    equations
     { 
       U 	1;
       C	1;
     }
}

// ************************************************************************* //
